{
  "backend/main.mo": "Motoko canister implementing core backend logic: user profiles, admin/access control, challenge session tracking, leaderboard calculation (best session XP), competition state flags, and ICP transaction bookkeeping with authorization checks on all queries and updates.",
  "feature_evidence.json": "Feature evidence report describing restoration of the typing challenge time bonus XP rule, linking the requirement to TypingChallenge.tsx with high confidence and associated components/tests.",
  "frontend-file-summaries.txt": "Prewritten high-level summaries of all major frontend files, outlining responsibilities for routing, hooks, pages, components, styles, and known backend stubs.",
  "frontend/index.css": "Global Tailwind CSS configuration defining design tokens, OKLCH color variables, dark/light themes, and base styles for the entire frontend.",
  "frontend/index.html": "HTML entry point that mounts the React app to the root div and loads the Vite/React main.tsx module.",
  "frontend/src/App.tsx": "Root React component managing authentication, backend actor connection, profile loading, error states, and page-level navigation between menu, challenge, stats, wallet, leaderboard, and admin views.",
  "frontend/src/components/Footer.tsx": "Simple footer component showing copyright, a heart icon, and attribution link to caffeine.ai.",
  "frontend/src/components/Header.tsx": "Top navigation header displaying branding, page navigation buttons, user info, and conditional admin access based on backend admin checks and profile state, with logout handling.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal component that lets a new user create a profile by choosing a username, with special handling and messaging if they are the first user (admin/owner). It uses React Query hooks to check first-user status, create the profile, and shows alerts and toasts for loading, success, and errors.",
  "frontend/src/components/SendICPPrizeModal.tsx": "Dialog modal for admins to send ICP prizes from the app canister to a recipient account ID. It validates balances and amounts, performs the transfer via a mutation hook, and shows success or error feedback.",
  "frontend/src/components/SetAppPrincipalModal.tsx": "This file is empty or contains no implementation, likely a placeholder for a future modal related to setting the app principal.",
  "frontend/src/config/appIdentity.ts": "Utility functions to resolve the backend canister principal from environment variables and derive its account identifier. Provides safe fallbacks, logging, and string helpers when values are unavailable or invalid.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and caches a backend canister actor based on the current Internet Identity using React Query. It reinitializes the actor on identity changes and invalidates dependent queries.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and provider managing Internet Identity authentication, login/logout, and identity persistence. Wraps DFINITY AuthClient and exposes detailed login status flags to the app.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for interacting with the backend actor, including user profiles, first-user flag, challenges, leaderboard data, and mutations. Handles caching, retries, and invalidation tied to identity and actor state.",
  "frontend/src/index.css": "Global Tailwind CSS setup defining base styles and extensive CSS variables for dark and light themes. Establishes design tokens for colors, radius, charts, and sidebar styling.",
  "frontend/src/lib/accountId.ts": "Implements client-side conversion of an Internet Computer Principal into an ICP account identifier using SHA-224 hashing and CRC32 checksum per the ICP specification.",
  "frontend/src/main.tsx": "Frontend entry point that creates the React root and wraps the app with React Query and Internet Identity providers.",
  "frontend/src/pages/AdminDashboard.tsx": "Admin-only dashboard for managing competition state, viewing canister balance and transaction history, copying canister identity details, and sending ICP prizes.",
  "frontend/src/pages/LeaderboardPage.tsx": "Displays the global leaderboard sorted by highest XP, with rank icons and a return-to-menu action.",
  "frontend/src/pages/LoginPage.tsx": "Landing and login page that integrates Internet Identity authentication, shows top public leaderboard entries, and displays the app canister account ID for donations.",
  "frontend/src/pages/MainMenu.tsx": "Main navigation menu presenting cards to start a challenge, view stats, manage wallet, or see the leaderboard.",
  "frontend/src/pages/StatsPage.tsx": "Shows a user's typing challenge statistics, including total XP, session count, averages, and a detailed challenge history table.",
  "frontend/src/pages/TypingChallenge.tsx": "Implements the 5-level timed typing challenge UI with predefined texts, progress tracking, XP scoring, skip/finish dialogs, anti-cheat input handling, and persistence of challenge sessions via a save-session hook.",
  "frontend/src/pages/WalletPage.tsx": "Provides a wallet UI to view ICP balance, derive and copy the user’s account ID, and submit withdrawal requests via backend hooks, with dialogs, validation, and toast feedback.",
  "frontend/src/types/index.ts": "Defines shared frontend TypeScript interfaces, including UserProfile aligned with the backend, and references backend-owned ChallengeSession types.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for reading URL and hash query parameters, persisting them in sessionStorage, and safely clearing sensitive parameters without page reloads.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining theme tokens, color system, container settings, animations, and plugins used across the frontend UI.",
  "project_state.json": "Project metadata snapshot describing TypeFaster’s architecture, features, and versions, including authentication, typing challenge gameplay, wallet, admin controls, and deployment context."
}