{
  "backend/main.mo": "Defines user profiles, challenge sessions, ICP transactions, and access‑controlled query/update methods including leaderboard, profile management, and competition state.",
  "feature_evidence.json": "Stub feature evidence report with an empty features array.",
  "frontend-file-summaries.txt": "Lists high‑level summaries for all frontend components, hooks, pages, and styles.",
  "frontend/index.css": "Tailwind base layer defining OKLCH color variables for light and dark themes plus global styles.",
  "frontend/index.html": "Basic HTML entry point loading the React app via main.tsx.",
  "frontend/src/App.tsx": "Main React app component handling authentication, backend actor connection, profile loading, routing, and error states.",
  "frontend/src/components/Footer.tsx": "Footer displaying copyright text and a caffeine.ai link with icons.",
  "frontend/src/components/Header.tsx": "Header showing branding, navigation buttons, user info, admin badge, and logout handling.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal for creating a new user profile with first‑user admin logic and validation.",
  "frontend/src/components/SendICPPrizeModal.tsx": "Modal form for sending ICP prizes, handling validation, submission, and success states using a mutation hook.",
  "frontend/src/components/SetAppPrincipalModal.tsx": "Empty file or placeholder for a modal to set the app’s canister principal.",
  "frontend/src/config/appIdentity.ts": "Resolves the app canister principal from environment variables and derives its account ID using ICP utilities.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor tied to the user’s identity, refreshing dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication state, login/clear functions, and initializes identities via AuthClient.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks wrapping backend calls for profiles, sessions, admin checks, and ICP prize actions.",
  "frontend/src/index.css": "Tailwind base styles defining dark and light theme CSS variables and global layout rules.",
  "frontend/src/lib/accountId.ts": "Implements ICP account identifier creation using SHA-224 hashing, CRC32 checksums, and principal conversion.",
  "frontend/src/main.tsx": "Application entry point setting up React Query and Internet Identity provider before rendering the app.",
  "frontend/src/pages/AdminDashboard.tsx": "Admin interface to control competition state, view canister identity, balance, and transaction history, and send ICP prizes.",
  "frontend/src/pages/LeaderboardPage.tsx": "Displays the global leaderboard sorted by top XP scores with rank icons and a return button.",
  "frontend/src/pages/LoginPage.tsx": "Login screen using Internet Identity with public leaderboard preview and feature highlight cards.",
  "frontend/src/pages/MainMenu.tsx": "Main navigation menu linking to challenge, stats, wallet, and leaderboard pages.",
  "frontend/src/pages/StatsPage.tsx": "Shows user challenge statistics including total XP, averages, and a table of past sessions.",
  "frontend/src/pages/TypingChallenge.tsx": "Implements the multi‑level typing challenge, calculating metrics and saving completed sessions.",
  "frontend/src/pages/WalletPage.tsx": "React wallet page showing user profile, ICP balance, withdrawal form, and copy-to-clipboard utilities using custom hooks.",
  "frontend/src/types/index.ts": "Defines UserProfile type matching backend structure with username, principal, accountId, and admin flag.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for reading, storing, persisting, and clearing URL and session parameters for routing.",
  "frontend/tailwind.config.js": "Tailwind configuration extending colors, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "JSON file describing project metadata, issues, and a feature request to redeploy the backend as a new canister."
}