{
  "backend/main.mo": "Main canister logic defining user profiles, challenge sessions, ICP transactions, visitor tracking, and query methods with access control.",
  "backend/migration.mo": "Migration utility converting old actor state to new format by adding a visitorCounts map.",
  "feature_evidence.json": "Feature evidence report mapping feature requests to affected frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries describing responsibilities of all frontend files for documentation or build planning.",
  "frontend/index.css": "Tailwind-based global stylesheet defining OKLCH color variables for light and dark themes.",
  "frontend/index.html": "HTML entry point loading the React application via main.tsx.",
  "frontend/src/App.tsx": "Main React app component handling identity, backend actor initialization, error states, routing, and profile setup modal.",
  "frontend/src/components/Footer.tsx": "Footer component showing © notice and caffeine.ai attribution with icons.",
  "frontend/src/components/Header.tsx": "Renders the app header with navigation buttons, user info, and admin controls based on authentication and admin status.",
  "frontend/src/components/ProfileSetupModal.tsx": "Displays a modal for creating a user profile, handling first-user admin assignment and form submission.",
  "frontend/src/components/SendICPPrizeModal.tsx": "Provides a modal for admins to send ICP prizes, including balance display, validation, and success feedback.",
  "frontend/src/components/SetAppPrincipalModal.tsx": "Empty component file with no implemented content.",
  "frontend/src/config/appIdentity.ts": "Resolves the backend canister ID from environment variables and derives its account identifier.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor instance based on identity, refreshing dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Manages Internet Identity authentication, providing identity state, login, and logout via React context.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for interacting with backend APIs for profiles, sessions, leaderboard, competition state, and ICP transfers.",
  "frontend/src/index.css": "Configures Tailwind layers and defines CSS variables for dark and light themes with global base styles.",
  "frontend/src/lib/accountId.ts": "Implements ICP account identifier generation using SHA-224, CRC32, and principal-to-hex conversion utilities.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with React Query and Internet Identity providers.",
  "frontend/src/pages/AdminDashboard.tsx": "Admin interface for managing competition state, viewing users, metrics, and transaction history with pagination and modals.",
  "frontend/src/pages/LeaderboardPage.tsx": "Displays a sorted global leaderboard with rank icons and a return button.",
  "frontend/src/pages/LoginPage.tsx": "Landing page that tracks visitors, shows features and top leaderboard entries, and initiates Internet Identity login.",
  "frontend/src/pages/MainMenu.tsx": "Main navigation menu offering entry points to challenge, stats, wallet, and leaderboard pages.",
  "frontend/src/pages/StatsPage.tsx": "Displays user typing stats and challenge history, computing totals and averages from fetched sessions.",
  "frontend/src/pages/TypingChallenge.tsx": "Implements a multi‑level typing challenge with progress tracking, metrics calculation, and session saving.",
  "frontend/src/pages/WalletPage.tsx": "Shows user ICP wallet info with placeholder balance and a disabled withdrawal workflow.",
  "frontend/src/types/index.ts": "Defines shared frontend types including the UserProfile interface.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for reading, storing, and clearing URL and session parameters.",
  "frontend/src/utils/visitorId.ts": "Generates an anonymized visitor ID by hashing the user's IP address with a fallback value.",
  "frontend/tailwind.config.js": "Configures Tailwind theme, colors, plugins, and extended utilities for the frontend.",
  "project_state.json": "Defines the current deployed app baseline, requested fixes, and new features including word-count correction, Top Players top-3 toggle, visitor analytics, and paginated Admin Users section. Also notes architectural constraints and a prior failed deployment attempt."
}