{
  "backend/main.mo": "Motoko backend defining user profiles, challenge sessions, transactions, and access-controlled queries including leaderboard logic and competition state tracking.",
  "feature_evidence.json": "Feature evidence report mapping feature requests to affected frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose and functionality of all major frontend source files.",
  "frontend/index.css": "Tailwind-based global CSS defining OKLCH color variables, dark mode styles, and base element styling.",
  "frontend/index.html": "HTML entry point loading the React app via main.tsx with a root mounting div.",
  "frontend/src/App.tsx": "Main React app handling authentication, backend actor connection, profile loading, page routing, and error states.",
  "frontend/src/components/Footer.tsx": "Footer component showing copyright text with caffeine.ai attribution and icons.",
  "frontend/src/components/Header.tsx": "Top navigation bar showing branding, navigation buttons, user info, and admin access based on profile and permissions.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal for creating a user profile, handling first-user admin setup and username submission.",
  "frontend/src/components/SendICPPrizeModal.tsx": "Modal for sending ICP prizes, handling account input, amount validation, and transaction submission feedback.",
  "frontend/src/components/SetAppPrincipalModal.tsx": "Empty or placeholder component file for setting the app principal.",
  "frontend/src/config/appIdentity.ts": "Utility functions to resolve the backend canister principal and derive its account identifier from environment variables.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and manages the authenticated or anonymous backend actor and refreshes dependent queries on identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and provider for managing Internet Identity authentication, stored identities, and login state.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for calling backend methods like profiles, first-user flag, sessions, and mutations.",
  "frontend/src/index.css": "Tailwind CSS setup defining dark and light theme variables and base styling.",
  "frontend/src/lib/accountId.ts": "Implements ICP account ID generation using principal bytes, SHA-224 hashing, CRC32, and hex formatting.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentity context providers.",
  "frontend/src/pages/AdminDashboard.tsx": "Admin interface to manage competition state, view balances and transactions, and access app canister identity.",
  "frontend/src/pages/LeaderboardPage.tsx": "Displays the global leaderboard sorted by top XP scores with ranking visuals.",
  "frontend/src/pages/LoginPage.tsx": "Login screen using Internet Identity with feature highlights and a public top-players leaderboard.",
  "frontend/src/pages/MainMenu.tsx": "Main navigation menu linking to challenges, stats, wallet, and leaderboard pages.",
  "frontend/src/pages/StatsPage.tsx": "Shows user statistics including total XP, session history, and detailed challenge metrics.",
  "frontend/src/pages/TypingChallenge.tsx": "Implements a multi-level typing challenge with tracking of accuracy, WPM, XP, and session saving, using UI components and tooltips.",
  "frontend/src/pages/WalletPage.tsx": "Provides wallet UI for viewing balances, generating account IDs, and initiating ICP withdrawals with clipboard and dialog interactions.",
  "frontend/src/types/index.ts": "Defines shared TypeScript types, including the UserProfile interface matching the backend.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, persisting, and clearing URL and session parameters for routing and admin token handling.",
  "frontend/tailwind.config.js": "TailwindCSS configuration extending theme colors, animations, and container settings with plugins.",
  "project_state.json": "Project metadata describing architecture, features, and known issues for the TypeFaster IC dapp."
}