{
  "backend/main.mo": "Main canister logic defining user profiles, challenge sessions with detailed metrics, leaderboard generation, access-controlled queries, and ICP transaction tracking.",
  "backend/migration.mo": "Migration module converting old challenge session format to the new metrics-based structure while preserving existing actor state.",
  "feature_evidence.json": "Feature evidence report mapping feature requests to affected frontend files, components, and test IDs with confidence levels.",
  "frontend-file-summaries.txt": "Prewritten summaries of all major frontend files describing their roles, logic, and key behaviors in the application.",
  "frontend/index.css": "Tailwind CSS theme variables and global styles defining light and dark mode color systems using OKLCH values.",
  "frontend/index.html": "Base HTML template loading the React application root and main entry script.",
  "frontend/src/App.tsx": "Main React app handling authentication, backend actor connection, profile loading, routing, and global error states.",
  "frontend/src/components/Footer.tsx": "Footer component displaying copyright text and caffeine.ai attribution with icons.",
  "frontend/src/components/Header.tsx": "Renders the main header with navigation, user info, admin links, and logout handling based on authentication and admin status.",
  "frontend/src/components/ProfileSetupModal.tsx": "Provides a modal for creating a user profile, including first-user admin logic and form submission with validation and feedback.",
  "frontend/src/components/SendICPPrizeModal.tsx": "Displays a modal to send ICP prizes, handling input validation, balance checks, mutation calls, and success feedback.",
  "frontend/src/components/SetAppPrincipalModal.tsx": "Empty file with no implementation.",
  "frontend/src/config/appIdentity.ts": "Resolves backend canister principal and derives the corresponding account identifier using environment variables.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor based on the user's identity and refreshes related queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, managing login, stored identity loading, and AuthClient configuration.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for user profiles, challenge sessions, competition state, and related mutations using an actor and Internet Identity.",
  "frontend/src/index.css": "Sets Tailwind base styles and CSS variables for dark and light themes, applying shared background and text colors.",
  "frontend/src/lib/accountId.ts": "Implements ICP account identifier generation using SHA‑224, CRC32, and principal-to-hex conversion utilities.",
  "frontend/src/main.tsx": "Initializes the app by rendering React with Internet Identity and React Query providers.",
  "frontend/src/pages/AdminDashboard.tsx": "Admin dashboard showing competition controls, canister identity, balance, and transaction history with copy and modal actions.",
  "frontend/src/pages/LeaderboardPage.tsx": "Displays a global leaderboard sorted by XP with rank icons and a return button.",
  "frontend/src/pages/LoginPage.tsx": "Login screen integrating Internet Identity and showing top public leaderboard entries plus feature highlights.",
  "frontend/src/pages/MainMenu.tsx": "Renders the main menu with navigation cards linking to challenge, stats, wallet, and leaderboard pages.",
  "frontend/src/pages/StatsPage.tsx": "Fetches and displays challenge session stats, summary metrics, and a history table with loading and empty states.",
  "frontend/src/pages/TypingChallenge.tsx": "Implements the typing challenge flow with multiple levels, metrics tracking, alerts, and session saving.",
  "frontend/src/pages/WalletPage.tsx": "Displays wallet info, generates account IDs, handles ICP withdrawal UI, and interacts with related backend queries.",
  "frontend/src/types/index.ts": "Defines frontend type mappings for user profiles based on backend interfaces.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for reading, storing, and clearing URL and session parameters, including hash routing support.",
  "frontend/tailwind.config.js": "Configures Tailwind theme extensions, colors, animations, and plugins for the frontend styling.",
  "project_state.json": "Defines the current TypeFaster project state, including schema version, overall app summary, and a list of existing implemented features with IDs, descriptions, and versions. Serves as a structured inventory of frontend and backend capabilities for planning."
}