{
  "kind": "build_request",
  "title": "Backend-only fixes: correct XP awards and ensure skipped/early-finish untyped words are persisted",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-5",
      "text": "Update backend challenge-session persistence so XP uses the correct scoring values: +5 XP per correct word and -10 XP per mistyped word (not +10 / -20). The backend must not trust any client-provided xpEarned value that would cause incorrect XP totals; it must normalize/stamp xpEarned at save time based on the submitted correctWords and mistypedWords fields.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-recent-1",
          "msg-recent-2"
        ],
        "quotes": [
          "fix earned xp, testing has shown that a correct word gives 10 XP instead of 5 XP and a mistyped word subtracts 20 XP instead of 10 XP as it should",
          "Proceed to building but remember don't make any changes to the frontend or other backend changes other than what I requested"
        ]
      },
      "acceptanceCriteria": [
        "When saveChallengeSession is called, the stored ChallengeSession.metrics.xpEarned equals (correctWords * 5) - (mistypedWords * 10) (plus/minus no other per-word multipliers).",
        "Leaderboard and Stats derived from stored sessions reflect the corrected xpEarned values for newly saved sessions.",
        "No frontend code changes are made to accomplish the XP fix."
      ]
    },
    {
      "id": "REQ-6",
      "text": "Ensure challenge-session persistence correctly retains untypedWords values even when the user ends a challenge early or skips levels (e.g., via \"Finish early\" or \"Skip Level\"); untypedWords provided in ChallengeMetrics must be stored exactly as received and included in subsequent getUserChallengeSessions responses.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-recent-1",
          "msg-recent-2"
        ],
        "quotes": [
          "make sure that untyped words are still counted from skipped levels when user clicks \"Finish early\" or \"Skip Level\"",
          "Proceed to building but remember don't make any changes to the frontend or other backend changes other than what I requested"
        ]
      },
      "acceptanceCriteria": [
        "Calling saveChallengeSession with a non-zero untypedWords results in getUserChallengeSessions returning sessions where metrics.untypedWords matches the saved value.",
        "The backend does not reset, drop, or overwrite untypedWords during session save.",
        "No frontend code changes are made to accomplish this persistence behavior."
      ]
    }
  ],
  "constraints": [
    "Do not make any frontend changes.",
    "Do not make any backend changes beyond the XP normalization fix and ensuring untypedWords is persisted/returned as-is.",
    "Keep all Motoko logic in the existing single actor (backend/main.mo).",
    "Do not introduce additional backend services or external databases."
  ],
  "nonGoals": [
    "Changing the typing challenge UI/UX or client-side calculations.",
    "Adding new metrics fields or changing the ChallengeMetrics type shape (to avoid requiring frontend changes).",
    "Redeploying to a brand-new canister ID (not requested in the active user instruction)."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}