{
  "kind": "build_request",
  "title": "Redeploy draft backend as a new canister (no non-backend changes)",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-4",
      "text": "Deploy the current draft backend again as a brand-new canister (new canister ID), without changing the backend code/behavior, and without making any frontend changes.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Deploy the draft backend again as a new canister, make sure to not change anything else that is not related to the backend"
        ]
      },
      "acceptanceCriteria": [
        "A new backend canister is created and deployed for the current draft version (i.e., the canister ID differs from the previous draft backend canister ID).",
        "No functional code changes are made to backend/main.mo aside from any deployment-generated artifacts; no schema/state migration work is introduced.",
        "No frontend files are modified as part of this change.",
        "The new backend canister principal/ID is recorded as an output of the deployment so it can be referenced for verification/debugging."
      ]
    }
  ],
  "constraints": [
    "Do not modify any frontend code or configuration.",
    "Do not change backend logic or add new features; only redeploy the existing draft backend to a new canister.",
    "Respect single-actor Motoko backend architecture (all logic remains in backend/main.mo)."
  ],
  "nonGoals": [
    "Investigating or fixing the underlying cause of the backend connection/origin error beyond performing the redeploy.",
    "Promoting the draft backend to a live environment."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}