{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix typed-word counting edge case, refine landing/results layouts, and remove Donate section",
  "requirements": [
    {
      "id": "REQ-6",
      "summary": "Correct typed-word counting so empty/fully-deleted input counts as 0 words and does not advance progress or gating.",
      "acceptanceCriteria": [
        "With an empty input (no characters typed), the on-screen “Words typed” count shows 0 (not 1).",
        "If the user types characters and then deletes them so the input becomes empty again, the “Words typed” count returns to 0.",
        "Clicking “Next Level” with an empty input does not record/reflect 1 typed word anywhere in the level’s progression or displayed counters.",
        "Progress calculation does not advance when the input is empty (progress remains 0%)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/TypingChallenge.tsx",
          "operation": "modify",
          "description": "Update typed-word parsing/counting to return 0 when userInput has no remaining non-whitespace characters; ensure progress %, exceeded-word detection, and the on-screen “Words typed” counter all use the corrected derived typed-words array/count (avoiding trim().split(' ') producing [''] for empty input)."
        }
      ]
    },
    {
      "id": "REQ-7",
      "summary": "Adjust landing page card sizing so “Top Players” and “Get Started” visually match the combined height of two small feature cards on desktop while staying responsive on mobile.",
      "acceptanceCriteria": [
        "On desktop (md and up), the “Top Players” card height matches the height of two stacked small feature cards (within reasonable visual tolerance).",
        "On desktop (md and up), the “Get Started” card height matches the height of two stacked small feature cards (within reasonable visual tolerance).",
        "Spacing, alignment, and card sizing look consistent across the section (no obviously mismatched card heights or awkward gaps).",
        "On mobile/small screens, the layout remains readable and does not overflow horizontally."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/LoginPage.tsx",
          "operation": "modify",
          "description": "Restructure the landing cards layout and apply consistent desktop sizing rules (e.g., shared min-heights / grid alignment) so the “Top Players” and “Get Started” cards visually equal ~2x the small feature card height on md+ breakpoints, while maintaining a clean stacked layout on small screens. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-8",
      "summary": "Polish results stat tiles so the WPM fallback text stays on one line and the stat boxes remain consistent and responsive.",
      "acceptanceCriteria": [
        "When the test duration is under 60 seconds, the WPM value text “not available (test duration < 60 secs)” renders on a single line (no wrapping).",
        "The results stat cards/tiles remain visually consistent (padding, alignment, and sizing) after resizing the WPM tile.",
        "The results layout remains responsive and does not overflow on small screens."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/TypingChallenge.tsx",
          "operation": "modify",
          "description": "Adjust the post-completion stats grid/tile styling so the WPM value uses non-wrapping text behavior and the stat tiles keep consistent padding/alignment/sizing across breakpoints (including small screens). Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-9",
      "summary": "Remove the “Donate here” section from the landing/footer area and ensure spacing remains intentional.",
      "acceptanceCriteria": [
        "The UI no longer shows any “Donate here:” text anywhere in the footer/landing page area.",
        "No donation account id is displayed in the UI.",
        "The rest of the landing page spacing looks intentional after removal (no large empty gap where the section was)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/LoginPage.tsx",
          "operation": "modify",
          "description": "Remove the landing-page donation UI block (“Donate here:” and account id), and clean up any related state/effects/imports so no donation account id is derived or rendered; ensure surrounding spacing/borders still look deliberate."
        }
      ]
    }
  ]
}